Hyf338/Gesture_control_of_smart_car/Data/OV/OV7725模块资料V2.0/C8051F330_OV7725 V1.0驱动(keil)/source/c8051f330_camera.c
/*******************************************************************************
*  Copyright (C) 2012 All Rights Reserved
*		
* хМ╪ЧвВуъ:	фО╥и╪рвЕ
* ╟Фх╗кЫсп: фО╥и╣Гвс	
* ╢╢╫╗хуфз:	2010дЙ6тб10ху 
* хМ╪ЧюЗй╥:	2010дЙ11тб2хупч╦д
			2012дЙ09тб10хупч╦д
* Version:  3.0 
* Demo лт╠╕╣ьж╥ё╨http://qifeidz.taobao.com
**********************************************************************************************************************************************
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюа
юаюаю╖р╩р╩р╩р╩юар╩р╩р╩р╩р╩р╩╤Чюаюаюаюаю╖р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюакд┘√юаюар╩р╩юаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩р╩р╩кдкдр╩р╩р╩юаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюар╩╤Чр╩юаюаюаюаюаюар╩р╩р╩р╩кд┘√╤Чр╩кдюар╩р╩юаюаюаюаюакдр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюакдюаюакдр╩р╩р╩р╩┘√юаюаюаюаюаюа
юаюаюакд┘√┘√р╩юаюа┘√юаюаюакдюаюаюаюаюаюаюаюаюаюаюаю╖р╩юар╩р╩юаюаюаюаюаюаюар╩р╩┘√┘√р╩р╩┘√┘√┘√р╩р╩юаюаюаюаюаюа┘√┘√┘√┘√┘√┘√р╩р╩┘√┘√┘√юаюаюаюаюаюа
юаюаюар╩юа╤Чр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюа╤Чр╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩кдюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюа
юаюаюар╩р╩р╩р╩р╩┘√╤Чр╩р╩┘√р╩юа┘√юаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩юаюар╩р╩юаюаюар╩ю╖юаюаюаюаюар╩р╩кдюаюаюаюар╩р╩юаюаю╖р╩р╩кдюаюаюа
юаюаюаюаюаюаюар╩ю╖р╩юар╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюар╩р╩юаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩┘√юаюаюаюаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юа╤Чр╩р╩р╩юакдю╖┘√р╩р╩р╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюакдр╩┘√юаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюа┘√р╩р╩р╩р╩р╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаю╖юаюа┘√р╩р╩юаюаюаюаюаюаюаюаюа
юаюаюаюар╩р╩р╩юаюаю╖р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩р╩р╩кдюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
**********************************************************************************************************************************************/
#include <c8051f330.h>
#include <english_16x8.h>

///////////////////////////////////////////////////////
#define	BLACK	0x0000
#define	BLUE	0x001F
#define	RED 	0xF800
#define	GREEN 	0x07E0
#define CYAN	0x07FF
#define MAGENTA 0xF81F
#define YELLOW	0xFFE0
#define WHITE	0xFFFF		

#define AM          001
#define TIME 		   100

#define SDA_IN()		{P0MDOUT= 0X00;}
#define SDA_OUT()		{P0MDOUT= 0XFF;}


//Tft control lines
sbit Tft_RS_PIN=P0^6;
sbit Tft_WR_PIN=P0^7;
sbit Tft_RST_PIN=P0^4;

//camera control lines
sbit I2C_SCL=P0^1;
sbit I2C_SDA=P0^0;
sbit Cmos_VSYNC=P0^5;
sbit SDA_STATE=P0^0;

//sn74lvc245 control lines
sbit Cmos_CS_PIN=P0^2;

//SN74LVC1G125 CONTROL LINES
sbit WR_CONTROL_PIN=P0^3;

void OSCILLATOR_Init (void);
void Port_Init(void);
void Ext_Interrupt_Init (void);

void Tft_Init(void);
void TftClear(unsigned int Color);
void Tft_WR_DATA16(unsigned int inputdata);
void TftWrite16(unsigned int index);
void TftWrite(unsigned int index,unsigned int inputdata);
void TftWR_Str(unsigned int x,unsigned int y,unsigned char *s,unsigned int color,unsigned int xcolor);
void TftWR_SingleStr(unsigned char inputdata,unsigned int color,unsigned int xcolor);
void Tft_SetBackground(unsigned int StartX,unsigned int StartY,unsigned int LongX,unsigned int LongY);
void Tft_SetCursor(unsigned int Xpos, unsigned int Ypos);

unsigned char WrCmos7670(unsigned char regID, unsigned char regDat);
unsigned char Cmos7670_init(void);
void set_Cmos7670reg(void);

void delay_us(unsigned int time);
void delay_ms(unsigned int time);
void delay( unsigned long cnt);

///////////////////////////////////////////
void DelayI2C(void);
void InitI2C(void);
void StartI2C(void);
void StopI2C(void);
void NoAck(void);
unsigned char I2CWrite(unsigned char DData);
////////////////////////////////////////////
unsigned int flag;
///////////////////////////////////////////

void main(void)
{
	PCA0MD &= ~0x40;                       
	OSCILLATOR_Init ();
	Port_Init();
	Ext_Interrupt_Init( );
	WR_CONTROL_PIN=1;
	Tft_Init( );	
	TftClear(BLACK);
	TftWR_Str(60,70,"C8051F330 Camera",RED,BLACK);
	TftWR_Str(60,100,"QI FEI DIAN ZI VER1.0",RED,BLACK);	
	TftWR_Str(60,130,"OV7670 Initializing......",RED,BLACK);
	delay_ms(3000);

	while(1!=Cmos7670_init());
	delay_ms(3000);
	TftClear(BLACK);
	TftWR_Str(60,110,"OV7670  Init  SUCCESS!  ",RED,BLACK);
	delay_ms(5000);

	TftClear(BLACK); 
	EA = 1;
	while(1);
	
  
}



void OSCILLATOR_Init (void)
{
    OSCICN  = 0x83; 
	RSTSRC =	0x04;                
}


void Port_Init(void)
{
  	
  	P0MDIN = 0xFF;
	P1MDIN = 0XFF;

	P0MDOUT= 0XFF;
	P1MDOUT= 0XFF;
 
  	P0SKIP = 0X00;
	P1SKIP = 0X00;

    XBR0   = 0x00;
    XBR1   = 0x40;


}



void Ext_Interrupt_Init (void)    
{
    IT01CF    = 0x0d;
	IT0=1;
    IE        = 0x01;
}


void INT0_ISR (void) interrupt 0  
{

	EA=0;
	IE0=0; 

	P0MDOUT= 0xff;
	WR_CONTROL_PIN=1;
	Cmos_CS_PIN=1;

	TftWrite(0x0020,0x0000);
	TftWrite(0x0021,0x013f); 
	TftWrite(0x0050,0x00);
	TftWrite(0x0051,239);
	TftWrite(0x0052,0x00);
	TftWrite(0x0053,319);
	TftWrite(0x0003,0x1018);
	TftWrite16(0x0022);


	Tft_RS_PIN=1;
	Tft_WR_PIN=0;


	WR_CONTROL_PIN=0;
	Cmos_CS_PIN=0;
 
 	EA=1;

}

void Tft_Init(void)
{
	 	
	Tft_RST_PIN=1;
	delay_ms(10);; 
	Tft_RST_PIN=0;
	delay_ms(10);
	Tft_RST_PIN=1;
	delay_ms(150);


		TftWrite(0x00e5, 0x8000);	
		TftWrite(0x0000, 0x0001);	
		TftWrite(0x0001, 0x0100);
		TftWrite(0x0002, 0x0700);
	#if AM==000       
		TftWrite(0x0003,0x1000);
	#elif AM==001        
		TftWrite(0x0003,0x1008);      
	#elif AM==010  
	    TftWrite(0x0003,0x1010);        
	#elif AM==011
		TftWrite(0x0003,0x1018);
	#elif AM==100  
		TftWrite(0x0003,0x1020);      
	#elif AM==101  
		TftWrite(0x0003,0x1028);      
	#elif AM==110  
		TftWrite(0x0003,0x1030);      
	#elif AM==111  
		TftWrite(0x0003,0x1038);
	#endif
		TftWrite(0x0004, 0x0000);
		TftWrite(0x0008, 0x0202);	
		TftWrite(0x0009, 0x0000);	
		TftWrite(0x000A, 0x0000);
		TftWrite(0x000C, 0x0000);	
		TftWrite(0x000D, 0x0000);	
		TftWrite(0x000F, 0x0000);	
		TftWrite(0x0010, 0x0000);	
		TftWrite(0x0011, 0x0007);	
		TftWrite(0x0012, 0x0000);	
		TftWrite(0x0013, 0x0000);	
		delay_ms(1000);
		TftWrite(0x0010, 0x17B0);	
		TftWrite(0x0011, 0x0007);	
		delay_ms(1000);
		TftWrite(0x0012, 0x013A);	
		delay_ms(1000);
		TftWrite(0x0013, 0x1A00);	
		TftWrite(0x0029, 0x000c);		
		delay_ms(1000);
		TftWrite(0x0030, 0x0000);	
		TftWrite(0x0031, 0x0505);	
		TftWrite(0x0032, 0x0004);	
		TftWrite(0x0035, 0x0006);	
		TftWrite(0x0036, 0x0707);	
		TftWrite(0x0037, 0x0105);	
		TftWrite(0x0038, 0x0002);	
		TftWrite(0x0039, 0x0707);	
		TftWrite(0x003C, 0x0704);	
		TftWrite(0x003D, 0x0807);	
		TftWrite(0x0050, 0x0000);
		TftWrite(0x0051, 0x00EF);
		TftWrite(0x0052, 0x0000);
		TftWrite(0x0053, 0x013F);
		TftWrite(0x0060, 0x2700);
		TftWrite(0x0061, 0x0001);
		TftWrite(0x006A, 0x0000);
	#if AM==000         
		TftWrite(0x0020,0x00ef);
		TftWrite(0x0021,0x013f);      
	#elif AM==001
		TftWrite(0x0020,0x00ef);
		TftWrite(0x0021,0x013f);      
	#elif AM==010
		TftWrite(0x0020,0x0000);
		TftWrite(0x0021,0x013f);      
	#elif AM==011
		TftWrite(0x0020,0x0000);
		TftWrite(0x0021,0x013f);       
	#elif AM==100
		TftWrite(0x0020,0x00ef);
		TftWrite(0x0021,0x0000);      
	#elif AM==101  
		TftWrite(0x0020,0x00ef);
		TftWrite(0x0021,0x0000);      
	#elif AM==110
		TftWrite(0x0020,0x0000);
		TftWrite(0x0021,0x0000);      
	#elif AM==111
		TftWrite(0x0020,0x0000);
		TftWrite(0x0021,0x0000);         
	#endif  	
		TftWrite(0x0080, 0x0000);	
		TftWrite(0x0081, 0x0000);
		TftWrite(0x0082, 0x0000);
		TftWrite(0x0083, 0x0000);
		TftWrite(0x0084, 0x0000);	
		TftWrite(0x0085, 0x0000);
		TftWrite(0x0090, 0x0010);	
		TftWrite(0x0092, 0x0000);
		TftWrite(0x0093, 0x0003);
		TftWrite(0x0095, 0x0110);
		TftWrite(0x0097, 0x0000);	
		TftWrite(0x0098, 0x0000);	
		TftWrite(0x0007, 0x0173);	
		delay_ms(1000);


  
}


void Tft_WR_DATA16(unsigned int inputdata)
{
     unsigned int inputdatah;
	 unsigned int inputdatal;
	 unsigned int x;
	 x=inputdata;
	 inputdatal=inputdata&0x00ff;
	 inputdatah=(inputdata&0xff00)>>8;
	 P1MDOUT= 0XFF;
	 Tft_RS_PIN=1;
	 P1=0x00;
	 P1=inputdatah; 
     Tft_WR_PIN=0;
     Tft_WR_PIN=1;
	 P1=0x00;
	 P1=inputdatal;
     Tft_WR_PIN=0;
     Tft_WR_PIN=1;	 
	 P1MDOUT= 0X00;
  
}


void TftWrite16(unsigned int index)
{   
     unsigned int indexh;
	 unsigned int indexl;
	 indexh=(index&0xff00)>>8;
	 indexl=index&0x00ff;
	 P1MDOUT= 0XFF;
	 Tft_RS_PIN=0;

	 P1=0x00;
     P1=indexh; 
	 Tft_WR_PIN=0;
     Tft_WR_PIN=1;

     P1=0x00;
	 P1=indexl;

	 Tft_WR_PIN=0;
     Tft_WR_PIN=1;

	 P1MDOUT= 0X00;

}


void TftWrite(unsigned int index,unsigned int inputdata)
{
    unsigned int x;
	unsigned int y;
    unsigned int indexh;
	unsigned int indexl;
	unsigned int inputdatah;
	unsigned int inputdatal;
	x=index;
	y=inputdata;
    indexh=(index&0xff00)>>8;
	indexl=index&0x00ff;
	inputdatah=(inputdata&0xff00)>>8;
	inputdatal=inputdata&0x00ff;
	P1MDOUT= 0XFF;
	Tft_RS_PIN= 0;

	P1=0;	
	P1=indexh;
	Tft_WR_PIN=0;   
	Tft_WR_PIN=1;
	P1=0;
	P1=indexl; 
	Tft_WR_PIN=0;   
	Tft_WR_PIN=1;

	Tft_RS_PIN=1; 
	P1=0;
	P1=inputdatah;
    Tft_WR_PIN=0;	
    Tft_WR_PIN=1;
	P1=0;
	P1=inputdatal; 
    Tft_WR_PIN=0;	
    Tft_WR_PIN=1;

	P1MDOUT= 0X00;

}

void TftClear(unsigned int Color)
{
  unsigned long index = 0;

	TftWrite(0x0050,0x00);
	TftWrite(0x0051,239);
	TftWrite(0x0052,0x00);
	TftWrite(0x0053,319);
	TftWrite(0x0020,0x0000);
	TftWrite(0x0021,0x0000);  
	TftWrite16(0x0022);    

  for(index = 0; index < 76800; index++)
  {
    Tft_WR_DATA16(Color);
   
  } 
 
}

void TftWR_SingleStr(unsigned char inputdata,unsigned int color,unsigned int xcolor)
{

  unsigned char avl,i,n;
  TftWrite16(0x0022);  
  for (i=0;i<16;i++)
  { 
      avl=(english[inputdata-32][i]);
	  for (n=0;n<8;n++)
	   {
	     if(avl&0x80) Tft_WR_DATA16(color);
             else Tft_WR_DATA16(xcolor);
           
	     avl<<=1;
	   }
	}
}
void TftWR_Str(unsigned int x,unsigned int y,unsigned char *s,unsigned int color,unsigned int xcolor)
{
 unsigned int k=0;
 while (*s) 
  {
     Tft_SetBackground(y,x+k,15,8);
     TftWR_SingleStr( *s,color,xcolor);
     k=k+8;
     s++;
  
  }

}  


void Tft_SetBackground(unsigned int StartX,unsigned int StartY,unsigned int LongX,unsigned int LongY)
{
  
#if AM==000    
	Tft_SetCursor(StartX+LongX-1,312-StartY+LongY-1);

#elif AM==001
	Tft_SetCursor(StartX+LongX-1,312-StartY+LongY-1);
     
#elif AM==010
	Tft_SetCursor(StartX,312-StartY+LongY-1);
     
#elif AM==011 
	Tft_SetCursor(StartX,312-StartY+LongY-1);
     
#elif AM==100
	Tft_SetCursor(StartX+LongX-1,312-StartY);     
     
#elif AM==101
	Tft_SetCursor(StartX+LongX-1,312-StartY);     
     
#elif AM==110
	Tft_SetCursor(StartX,312-StartY); 
     
#elif AM==111
	Tft_SetCursor(StartX,312-StartY);  
     
#endif
     
	TftWrite(0x0050,StartX);
	TftWrite(0x0051,StartX+LongX-1);
	TftWrite(0x0052,312-StartY);
	TftWrite(0x0053,312-StartY+LongY-1);
}

void Tft_SetCursor(unsigned int Xpos, unsigned int Ypos)
{
 
  TftWrite(0x20, Xpos);
  TftWrite(0x21, Ypos);
}



void set_Cmos7670reg(void)
{

	flag=0;
	WrCmos7670(0x3a, 0x04);
	WrCmos7670(0x40, 0xd0);
	WrCmos7670(0x12, 0x14);
	WrCmos7670(0x32, 0x80);
	WrCmos7670(0x17, 0x16);
	WrCmos7670(0x18, 0x04);
	WrCmos7670(0x19, 0x02);
	WrCmos7670(0x1a, 0x7b);
	WrCmos7670(0x03, 0x06);
	WrCmos7670(0x0c, 0x04);
	WrCmos7670(0x3e, 0x00);
	WrCmos7670(0x70, 0x3a);
	WrCmos7670(0x71, 0x35);
	WrCmos7670(0x72, 0x11);
	WrCmos7670(0x73, 0x00);
	WrCmos7670(0xa2, 0x02);
	WrCmos7670(0x11, 0x81);
	
	WrCmos7670(0x7a, 0x20);
	WrCmos7670(0x7b, 0x1c);
	WrCmos7670(0x7c, 0x28);
	WrCmos7670(0x7d, 0x3c);
	WrCmos7670(0x7e, 0x55);
	WrCmos7670(0x7f, 0x68);
	WrCmos7670(0x80, 0x76);
	WrCmos7670(0x81, 0x80);
	WrCmos7670(0x82, 0x88);
	WrCmos7670(0x83, 0x8f);
	WrCmos7670(0x84, 0x96);
	WrCmos7670(0x85, 0xa3);
	WrCmos7670(0x86, 0xaf);
	WrCmos7670(0x87, 0xc4);
	WrCmos7670(0x88, 0xd7);
	WrCmos7670(0x89, 0xe8);
	
	WrCmos7670(0x13, 0xe0);
	WrCmos7670(0x00, 0x00);
	
	WrCmos7670(0x10, 0x00);
	WrCmos7670(0x0d, 0x00);
	WrCmos7670(0x14, 0x28);
	WrCmos7670(0xa5, 0x05);
	WrCmos7670(0xab, 0x07);
	WrCmos7670(0x24, 0x75);
	WrCmos7670(0x25, 0x63);
	WrCmos7670(0x26, 0xA5);
	WrCmos7670(0x9f, 0x78);
	WrCmos7670(0xa0, 0x68);
	WrCmos7670(0xa1, 0x03);
	WrCmos7670(0xa6, 0xdf);
	WrCmos7670(0xa7, 0xdf);
	WrCmos7670(0xa8, 0xf0);
	WrCmos7670(0xa9, 0x90);
	WrCmos7670(0xaa, 0x94);
	WrCmos7670(0x13, 0xe5);

	WrCmos7670(0x0e, 0x61);
	WrCmos7670(0x0f, 0x4b);
	WrCmos7670(0x16, 0x02);
	WrCmos7670(0x1e, 0x27);
	WrCmos7670(0x21, 0x02);
	WrCmos7670(0x22, 0x91);
	WrCmos7670(0x29, 0x07);
	WrCmos7670(0x33, 0x0b);
	WrCmos7670(0x35, 0x0b);
	WrCmos7670(0x37, 0x1d);
	WrCmos7670(0x38, 0x71);
	WrCmos7670(0x39, 0x2a);
	WrCmos7670(0x3c, 0x78);
	WrCmos7670(0x4d, 0x40);
	WrCmos7670(0x4e, 0x20);
	WrCmos7670(0x69, 0x00);
	WrCmos7670(0x6b, 0x60);
	WrCmos7670(0x74, 0x19);
	WrCmos7670(0x8d, 0x4f);
	WrCmos7670(0x8e, 0x00);
	WrCmos7670(0x8f, 0x00);
	WrCmos7670(0x90, 0x00);
	WrCmos7670(0x91, 0x00);
	WrCmos7670(0x92, 0x00);
	WrCmos7670(0x96, 0x00);
	WrCmos7670(0x9a, 0x80);
	WrCmos7670(0xb0, 0x84);
	WrCmos7670(0xb1, 0x0c);
	WrCmos7670(0xb2, 0x0e);
	WrCmos7670(0xb3, 0x82);
	WrCmos7670(0xb8, 0x0a);



	WrCmos7670(0x43, 0x14);
	WrCmos7670(0x44, 0xf0);
	WrCmos7670(0x45, 0x34);
	WrCmos7670(0x46, 0x58);
	WrCmos7670(0x47, 0x28);
	WrCmos7670(0x48, 0x3a);
	WrCmos7670(0x59, 0x88);
	WrCmos7670(0x5a, 0x88);
	WrCmos7670(0x5b, 0x44);
	WrCmos7670(0x5c, 0x67);
	WrCmos7670(0x5d, 0x49);
	WrCmos7670(0x5e, 0x0e);
	WrCmos7670(0x64, 0x04);
	WrCmos7670(0x65, 0x20);
	WrCmos7670(0x66, 0x05);
	WrCmos7670(0x94, 0x04);
	WrCmos7670(0x95, 0x08);
	WrCmos7670(0x6c, 0x0a);
	WrCmos7670(0x6d, 0x55);
	WrCmos7670(0x6e, 0x11);
	WrCmos7670(0x6f, 0x9f);
	WrCmos7670(0x6a, 0x40);
	WrCmos7670(0x01, 0x40);
	WrCmos7670(0x02, 0x40);
	WrCmos7670(0x13, 0xe7);
	WrCmos7670(0x15, 0x00);  
	
	
	WrCmos7670(0x4f, 0x80);
	WrCmos7670(0x50, 0x80);
	WrCmos7670(0x51, 0x00);
	WrCmos7670(0x52, 0x22);
	WrCmos7670(0x53, 0x5e);
	WrCmos7670(0x54, 0x80);
	WrCmos7670(0x58, 0x9e);
	
	WrCmos7670(0x41, 0x08);
	WrCmos7670(0x3f, 0x00);
	WrCmos7670(0x75, 0x05);
	WrCmos7670(0x76, 0xe1);
	WrCmos7670(0x4c, 0x00);
	WrCmos7670(0x77, 0x01);
	WrCmos7670(0x3d, 0xc2);	
	WrCmos7670(0x4b, 0x09);
	WrCmos7670(0xc9, 0x60);
	WrCmos7670(0x41, 0x38);
	WrCmos7670(0x56, 0x40);
	
	WrCmos7670(0x34, 0x11);
	WrCmos7670(0x3b, 0x02); 
								
	WrCmos7670(0xa4, 0x89);
	WrCmos7670(0x96, 0x00);
	WrCmos7670(0x97, 0x30);
	WrCmos7670(0x98, 0x20);
	WrCmos7670(0x99, 0x30);
	WrCmos7670(0x9a, 0x84);
	WrCmos7670(0x9b, 0x29);
	WrCmos7670(0x9c, 0x03);
	WrCmos7670(0x9d, 0x4c);
	WrCmos7670(0x9e, 0x3f);
	WrCmos7670(0x78, 0x04);
	
}



unsigned char WrCmos7670(unsigned char regID, unsigned char regDat)
{
	StartI2C();
	if(0==I2CWrite(0x42))
	{
		StopI2C();
		return(0);
	}
	delay_us(100);
  	if(0==I2CWrite(regID))
	{
		StopI2C();
		return(0);
	}
	delay_us(100);
  	if(0==I2CWrite(regDat))
	{
		StopI2C();
		return(0);
	}
  	StopI2C();
	flag++;
	
  	return(1);
}



unsigned char Cmos7670_init(void)
{
	unsigned char mmm;	
	unsigned int i=0;
	
	InitI2C();

	mmm=0x80;
	if(0==WrCmos7670(0x12, mmm)) 
	{
		return 0 ;
	}
	delay_ms(10);

  	set_Cmos7670reg();
	if(flag!=164)
	return 0;

	return 1; 
} 


void InitI2C(void)
{

	P1MDIN = 0XFF;
	P1MDOUT= 0XFF;

}

void StartI2C(void)
{
	I2C_SDA=1;    
    delay_us(100);

    I2C_SCL=1;	   
    delay_us(100);
 
    I2C_SDA=0;
    delay_us(100);

    I2C_SCL=0;	 
    delay_us(100);


}

void StopI2C(void)
{
	I2C_SDA=0;
    delay_us(100);
 
    I2C_SCL=1;
    delay_us(100);  

    I2C_SDA=1;
    delay_us(100);
 

}


/*void NoAck(void)
{
	
	I2C_SDA=1;
	delay_us(100);
	
	I2C_SCL=1;
	delay_us(100);
	
	I2C_SCL=0;
	delay_us(100);
	
	I2C_SDA=0;
	delay_us(100);

} */


unsigned char I2CWrite(unsigned char DData)
{
	unsigned char j,tem;

	for(j=0;j<8;j++) 
	{
		if((DData<<j)&0x80)
		{
			I2C_SDA=1;
		}
		else
		{
			I2C_SDA=0;
		}
		delay_us(100);
		I2C_SCL=1;
		delay_us(100);
		I2C_SCL=0;;
		delay_us(100);

	}
	delay_us(100);
	
	SDA_IN();
	delay_us(100);
	I2C_SCL=1;
	delay_us(1000);
	if(SDA_STATE==1)
	{
		tem=0;  
	}
	else
	{
		tem=1;   
	}
	I2C_SCL=0;
	delay_us(100);	
    SDA_OUT();

	return(tem);  
}


void delay_us(unsigned int time)
 {     
   while (time--);
 }		  

/*	    ╨ацК╪╤ясй╠╨╞йЩ	*/	 
void delay_ms(unsigned int time)
	 {
	  while(time--) delay_us(100);  		 
	 }
	 
